"""
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.
"""

i1 = 0
i2 = 1
i = 0
sum = 0

while i != -1:
    s = i1 + i2
    i1 = i2
    i2 = s
    i += 1
    if i2 > 4000000:
        break
    if i % 2 == 0:
        sum += s

print (str(sum))
input('Press ENTER to exit')
